#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
	// Функция - Женский род от названия перечисления
	//
	// Параметры:
	//  Направление	 - ПеречислениеСсылка.НаправленияСообщенийМЭДО	- Направление, которое надо преобразовать
	// 
	// Возвращаемое значение:
	//  Строка
	//
	Функция ЖенскийРод(Направление) Экспорт
		
		Если Направление = Входящее Тогда
			Возврат "Входящая";
		ИначеЕсли Направление = Исходящее Тогда
			Возврат "Исходящая";
		КонецЕсли;
		
		Возврат "";
		
	КонецФункции
	
	
	// Направление документа.
	// 
	// Параметры:
	//  Документ - ОпределяемыйТип.ПредметМЭДО - Документ
	// 
	// Возвращаемое значение:
	//  ПеречислениеСсылка.НаправленияСообщенийМЭДО - Направление документа
	Функция НаправлениеДокумента(Документ) Экспорт
		
		Если ИнтеграцияСМЭДО.ЭтоВходящийДокумент(Документ) Тогда
			Возврат Входящее;
		ИначеЕсли ИнтеграцияСМЭДО.ЭтоИсходящийДокумент(Документ) Тогда
			Возврат Исходящее;
		Иначе
			Возврат ПустаяСсылка();
		КонецЕсли;
		
	КонецФункции
	
#КонецОбласти

#КонецЕсли