#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ИдентификаторУведомления");
	Поля.Добавить("ИдентификаторДокумента");
	Поля.Добавить("Документ");
	Поля.Добавить("Направление");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон(
		НСтр("ru = '%1 уведомление МЭДО %2 (на %3)'"), 
		Данные.Направление,
		Данные.ИдентификаторУведомления,
		МЭДО.ЗаполненноеЗначение(Данные.Документ, Данные.ИдентификаторДокумента));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли